;==========================================================
;  FILE:   ElementalHeavyThrowers.uc                                    
;  
;	File created by RustyDios	30/10/20    12:00
;	LAST UPDATED				17/11/20    20:00
;
;==========================================================

[Heavythrower_Fire X2WeaponTemplate]
FriendlyName="Fire Thrower"
FriendlyNamePlural="Fire Thrower"
BriefSummary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."
TacticalText="<Bullet/> This wrist-mounted chemthrower is an area-of-effect weapon that can lay waste to a large part of the battlefield.\n<Bullet/> It is useful against multiple enemies at close quarters. Robotic enemies may be resistant or immune to its effects.\n<Bullet/> It hits everything in the area, but can be blocked by cover.\n<Bullet/> Uses all remaining action points, but is affected by 'Salvo', 'Burning Rush' and 'Rainmaker'."

[Heavythrower_Fire_Mk2 X2WeaponTemplate]
FriendlyName="Hellfire Projector"
FriendlyNamePlural="Hellfire Projectors"
BriefSummary="This upgraded wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."
TacticalText="<Bullet/> This upgraded wrist-mounted chemthrower is an area-of-effect weapon that can lay waste to a large part of the battlefield.\n<Bullet/> It is useful against multiple enemies at close quarters. Robotic enemies may be resistant or immune to its effects.\n<Bullet/> It hits everything in the area, but can be blocked by cover.\n<Bullet/> Uses all remaining action points, but is affected by 'Salvo', 'Burning Rush' and 'Rainmaker'."

[Heavythrower_Fire_Soldier X2AbilityTemplate]
LocFriendlyName="Fire Thrower"
LocHelpText="Spray fire in a cone-shaped area. Has a chance to burn."

[Heavythrower_Fire_Mk2_Soldier X2AbilityTemplate]
LocFriendlyName="Hellfire Projector"
LocHelpText="Spray fire in a cone-shaped area. Has a chance to burn."

[Heavythrower_Fire_Spark X2AbilityTemplate]
LocFriendlyName="Fire Thrower (SPARK)"
LocHelpText="Spray fire in a cone-shaped area. Has a chance to burn."

[Heavythrower_Fire_Mk2_Spark X2AbilityTemplate]
LocFriendlyName="Hellfire Projector (SPARK)"
LocHelpText="Spray fire in a cone-shaped area. Has a chance to burn."

;==========================================================
[Heavythrower_Cryo X2WeaponTemplate]
FriendlyName="Cryo Thrower"
FriendlyNamePlural="Cryo Thrower"
BriefSummary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."
TacticalText="<Bullet/> This wrist-mounted chemthrower is an area-of-effect weapon that can lay waste to a large part of the battlefield.\n<Bullet/> It is useful against multiple enemies at close quarters. Robotic enemies may be resistant or immune to its effects.\n<Bullet/> It hits everything in the area, but can be blocked by cover.\n<Bullet/> Uses all remaining action points, but is affected by 'Salvo', 'Burning Rush' and 'Rainmaker'."

[Heavythrower_Cryo_Mk2 X2WeaponTemplate]
FriendlyName="Hydra Projector"
FriendlyNamePlural="Hydra Projectors"
BriefSummary="This upgraded wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."
TacticalText="<Bullet/> This upgraded wrist-mounted chemthrower is an area-of-effect weapon that can lay waste to a large part of the battlefield.\n<Bullet/> It is useful against multiple enemies at close quarters. Robotic enemies may be resistant or immune to its effects.\n<Bullet/> It hits everything in the area, but can be blocked by cover.\n<Bullet/> Uses all remaining action points, but is affected by 'Salvo', 'Burning Rush' and 'Rainmaker'."

[Heavythrower_Cryo_Soldier X2AbilityTemplate]
LocFriendlyName="Cryo Thrower"
LocHelpText="Spray frost in a cone-shaped area. Will freeze targets instantly."

[Heavythrower_Cryo_Mk2_Soldier X2AbilityTemplate]
LocFriendlyName="Hydra Projector"
LocHelpText="Spray frost in a cone-shaped area. Will freeze targets instantly."

[Heavythrower_Cryo_Spark X2AbilityTemplate]
LocFriendlyName="Cryo Thrower (SPARK)"
LocHelpText="Spray frost in a cone-shaped area. Will freeze targets instantly."

[Heavythrower_Cryo_Mk2_Spark X2AbilityTemplate]
LocFriendlyName="Hydra Projector (SPARK)"
LocHelpText="Spray frost in a cone-shaped area. Will freeze targets instantly."

;==========================================================
[Heavythrower_Poison X2WeaponTemplate]
FriendlyName="Poison Thrower"
FriendlyNamePlural="Poison Thrower"
BriefSummary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."
TacticalText="<Bullet/> This wrist-mounted chemthrower is an area-of-effect weapon that can lay waste to a large part of the battlefield.\n<Bullet/> It is useful against multiple enemies at close quarters. Robotic enemies may be resistant or immune to its effects.\n<Bullet/> It hits everything in the area, but can be blocked by cover.\n<Bullet/> Uses all remaining action points, but is affected by 'Salvo', 'Burning Rush' and 'Rainmaker'."

[Heavythrower_Poison_Mk2 X2WeaponTemplate]
FriendlyName="Haze Projector"
FriendlyNamePlural="Haze Projectors"
BriefSummary="This upgraded wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."
TacticalText="<Bullet/> This upgraded wrist-mounted chemthrower is an area-of-effect weapon that can lay waste to a large part of the battlefield.\n<Bullet/> It is useful against multiple enemies at close quarters. Robotic enemies may be resistant or immune to its effects.\n<Bullet/> It hits everything in the area, but can be blocked by cover.\n<Bullet/> Uses all remaining action points, but is affected by 'Salvo', 'Burning Rush' and 'Rainmaker'."

[Heavythrower_Poison_Soldier X2AbilityTemplate]
LocFriendlyName="Poison Thrower"
LocHelpText="Spray poison in a cone-shaped area. Has a chance to poison targets."

[Heavythrower_Poison_Mk2_Soldier X2AbilityTemplate]
LocFriendlyName="Haze Projector"
LocHelpText="Spray poison in a cone-shaped area. Has a chance to poison targets."

[Heavythrower_Poison_Spark X2AbilityTemplate]
LocFriendlyName="Poison Thrower (SPARK)"
LocHelpText="Spray poison in a cone-shaped area. Has a chance to poison targets."

[Heavythrower_Poison_Mk2_Spark X2AbilityTemplate]
LocFriendlyName="Haze Projector (SPARK)"
LocHelpText="Spray poison in a cone-shaped area. Has a chance to poison targets."

;==========================================================
[Heavythrower_Acid X2WeaponTemplate]
FriendlyName="Acid Thrower"
FriendlyNamePlural="Acid Throwers"
BriefSummary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."
TacticalText="<Bullet/> This wrist-mounted chemthrower is an area-of-effect weapon that can lay waste to a large part of the battlefield.\n<Bullet/> It is useful against multiple enemies at close quarters. Robotic enemies may be resistant or immune to its effects.\n<Bullet/> It hits everything in the area, but can be blocked by cover.\n<Bullet/> Uses all remaining action points, but is affected by 'Salvo', 'Burning Rush' and 'Rainmaker'."

[Heavythrower_Acid_Mk2 X2WeaponTemplate]
FriendlyName="Helix Projector"
FriendlyNamePlural="Helix Projectors"
BriefSummary="This upgraded wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."
TacticalText="<Bullet/> This upgraded wrist-mounted chemthrower is an area-of-effect weapon that can lay waste to a large part of the battlefield.\n<Bullet/> It is useful against multiple enemies at close quarters. Robotic enemies may be resistant or immune to its effects.\n<Bullet/> It hits everything in the area, but can be blocked by cover.\n<Bullet/> Uses all remaining action points, but is affected by 'Salvo', 'Burning Rush' and 'Rainmaker'."

[Heavythrower_Acid_Soldier X2AbilityTemplate]
LocFriendlyName="Acid Thrower"
LocHelpText="Spray acid in a cone-shaped area. Melts armor and causes caustic burns."

[Heavythrower_Acid_Mk2_Soldier X2AbilityTemplate]
LocFriendlyName="Helix Projector"
LocHelpText="Spray acid in a cone-shaped area. Melts armor and causes caustic burns."

[Heavythrower_Acid_Spark X2AbilityTemplate]
LocFriendlyName="Acid Thrower (SPARK)"
LocHelpText="Spray acid in a cone-shaped area. Melts armor and causes caustic burns."

[Heavythrower_Acid_Mk2_Spark X2AbilityTemplate]
LocFriendlyName="Helix Projector (SPARK)"
LocHelpText="Spray acid in a cone-shaped area. Melts armor and causes caustic burns."

;==========================================================
;shouldn't see any of this in game, hidden passive
; ... but just in case copy of Rainmaker
; ... someone might want the flyover ?
[RustyRainmakerExtension X2AbilityTemplate]
LocFriendlyName="Rainmaker Extended"
LocLongDescription="Equipped heavy weapons deal +<Ability:Rainmaker_BonusDamage/> damage and have increased area of effect. The extension here covers wrist-mounted chemthrowers."
LocHelpText="Equipped heavy weapons deal more damage and affect a larger area."
LocPromotionPopupText="<Bullet/> Rainmaker adds +<Ability:Rainmaker_BonusDamage/> damage to all heavy weapons.<br/><Bullet/> Heavy weapons with circular areas of effect have their radius increased by +<Ability:Rainmaker_BonusRadius/>.<br/><Bullet/> Heavy weapons with conic areas of effect have their diameter increased by +<Ability:Rainmaker_BonusDiameter/> and length increased by +<Ability:Rainmaker_BonusLength/>.<br/>"
LocFlyover="Rainmaker Ext"

;   ======================================================================
;   ================ PROVING GROUND OVERHAUL V2 LOCALI ===================
;   ======================================================================

[Heavythrower_FireUnlockTech X2TechTemplate]
DisplayName="Heavy Experimental Arm Thrower: Fire"
Summary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."

[Heavythrower_AcidUnlockTech X2TechTemplate]
DisplayName="Heavy Experimental Arm Thrower: Acid"
Summary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."

[Heavythrower_CryoUnlockTech X2TechTemplate]
DisplayName="Heavy Experimental Arm Thrower: Cryo"
Summary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."

[Heavythrower_PoisonUnlockTech X2TechTemplate]
DisplayName="Heavy Experimental Arm Thrower: Poison"
Summary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."

[Heavythrower_Fire_Lv2UnlockTech X2TechTemplate]
DisplayName="Heavy Experimental Arm Thrower: Hellfire Projector"
Summary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."

[Heavythrower_Acid_Lv2UnlockTech X2TechTemplate]
DisplayName="Heavy Experimental Arm Thrower: Helix Projector"
Summary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."

[Heavythrower_Cryo_Lv2UnlockTech X2TechTemplate]
DisplayName="Heavy Experimental Arm Thrower: Hydra Projector"
Summary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."

[Heavythrower_Poison_Lv2UnlockTech X2TechTemplate]
DisplayName="Heavy Experimental Arm Thrower: Haze Projector"
Summary="This wrist-mounted chemthrower relies on a super-pressurized cartridge of chemicals and a wide focused nozzle to unleash a deadly cone of chemicals on multiple enemies. It has a limited amount of charges."
